src/Documents/фуКадровоеИзменение/фуКадровоеИзменение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>фуКадровоеИзменение</name>
  <registerRecords>InformationRegister.фуКадроваяИсторияСотрудников</registerRecords>
  <attributes>
    <name>ВалютаВыплатыЗарплаты</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.фуГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКадровогоИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Департамент</name>
    <type>
      <types>CatalogRef.фуДепартамент</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.фуДолжности</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МотивационнаяСхема</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПриказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкладОфициальный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкладУправленческий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.фуОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.фуОтделы</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.фуСотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.фуСотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>УИД_Транзакции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХарактерРаботы</name>
    <type>
      <types>CatalogRef.фуХарактерРаботы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СканыДокументовКадры</name>
    <attributes>
      <name>СканДокумента</name>
      <type>
        <types>CatalogRef.фуСканыДокументовКадры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/фуКадроваяИсторияСотрудников/фуКадроваяИсторияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>фуКадроваяИсторияСотрудников</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.фуВидыКадровыхСобытий</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.фуОрганизации</types>
    </type>
  </resources>
  <resources>
    <name>Департамент</name>
    <type>
      <types>CatalogRef.фуДепартамент</types>
    </type>
  </resources>
  <resources>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.фуОтделы</types>
    </type>
  </resources>
  <resources>
    <name>Группа</name>
    <type>
      <types>CatalogRef.фуГруппы</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.фуДолжности</types>
    </type>
  </resources>
  <resources>
    <name>ОкладОфициальный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОкладУправленческий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПриемаНаРаботу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>МотивационнаяСхема</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ВалютаВыплатыЗарплаты</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.фуСотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ХарактерРаботы</name>
    <type>
      <types>CatalogRef.фуХарактерРаботы</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.фуСотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/фуВидыКадровыхСобытий/фуВидыКадровыхСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>фуВидыКадровыхСобытий</name>
  <enumValues>
    <name>ПриемНаРаботу</name>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
  </enumValues>
  <enumValues>
    <name>КадровоеИзменение</name>
  </enumValues>
</mdclass:Enum>

src/Documents/фуКадровоеИзменение/ObjectModule.bsl
#Область о // Стандартные процедуры и функции:

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    
    Если Не ЗначениеЗаполнено(ЭтотОбъект.ДатаКадровогоИзменения) Тогда
		ЭтотОбъект.ДатаКадровогоИзменения = ЭтотОбъект.Дата;
	КонецЕсли;		
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ДатаПриказа) Тогда
		ЭтотОбъект.ДатаПриказа = ЭтотОбъект.ДатаКадровогоИзменения;
	КонецЕсли; 
	
	// +++ Чесноков М.С. 2021-09-22 F1-121
	фуКадровыйУчетСервер.УдалениеСкановДокументаПередЗаписью(ЭтотОбъект);
	// --- Чесноков М.С. 2021-09-22 F1-121
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	// +++ Чесноков М.С. 2021-09-22 F1-121
	ЭтотОбъект.Сотрудник = Справочники.фуСотрудники.ПустаяСсылка();
	ЭтотОбъект.СканыДокументовКадры.Очистить();
	// --- Чесноков М.С. 2021-09-22 F1-121

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ЗаписьДвижений_фуКадроваяИсторияСотрудников(Отказ,Режим);
    
КонецПроцедуры

#КонецОбласти

#Область о // Запись движений:

Процедура ЗаписьДвижений_фуКадроваяИсторияСотрудников(Отказ,Режим)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Сотрудник) Тогда
		фуОбщийКлиентСервер.СообщитьПользователю("Внимание! Не задан сотрудник. Операция проведения прервана.");
		Отказ = Истина;
    КонецЕсли;
    
    КадровыеДанныеСотрудника = фуКадровыйУчетСервер.ПолучитьКадровыеДанныеСотрудника(ЭтотОбъект.Сотрудник,НачалоДня(ЭтотОбъект.ДатаКадровогоИзменения)-1);
	
	Движение = Движения.фуКадроваяИсторияСотрудников.Добавить();
    //
    ЗаполнитьЗначенияСвойств(Движение,КадровыеДанныеСотрудника);
    ЗаполнитьЗначенияСвойств(Движение,ЭтотОбъект);
    //
    Движение.Период = ЭтотОбъект.ДатаКадровогоИзменения;
	Движение.ВидСобытия = Перечисления.фуВидыКадровыхСобытий.КадровоеИзменение;
    
    Движения.фуКадроваяИсторияСотрудников.Записать(Истина);
    
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Если ДанныеЗаполнения.Свойство("Сотрудник") Тогда
			ЭтотОбъект.Сотрудник = ДанныеЗаполнения.Сотрудник;
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
